{
    "item1": {
        "description": "This project is a mockup of an ecommerce website. It utilises Redux to manage the state of a customer's shopping cart. More features such as a customer account section will be added in a later release. In this version, users can browse products by category, filter products by price and add items to a shopping cart.",
        "id": 1,
        "img": "portfolio-ecommerce.png",
        "project_url": "https://e-commerce-mockup.web.app/",
        "skills": [
            "React",
            "Redux",
            "Javascript",
            "Scss",
            "API"
        ],
        "title": "E-commerce Mockup"
    },
    "item2": {
        "description": "Built using React and Redux, this project utlises Spotify’s API to retrieve a list of artists, albums and playlists for a specified search term. \n Redux is used to manage the login and search result states. An access token is retrieved from Spotify and stored in the browser’s local storage to make accessing the app more convenient for future use.",
        "id": 2,
        "img": "portfolio-spotify-search.png",
        "project_url": "https://spotify-search-2d1d9.web.app/",
        "skills": [
            "React",
            "Redux",
            "Javascript",
            "Scss",
            "API"
        ],
        "title": "Spotify Search API"
    },
    "item3": {
        "description": "Problems Afoot is a podiatry clinic with two locations based in Oxfordshire. This client required a website to display their services, location details and ultimately to convert users to book an appointment.\nThis project utilises many React features including state management, routing and reusable components to display content from an array of objects.\nThe location components make use of Google’s map API to display the location of each surgery.",
        "id": 3,
        "img": "portfolio-problems-afoot.png",
        "project_url": "https://problems-afoot-58652.web.app/",
        "skills": [
            "React",
            "API",
            "HTML",
            "Scss",
            "Javascript"
        ],
        "title": "Problems Afoot Podiatry"
    },
    "item4": {
        "description": "An online pairs game in which the user has to find all matching cards in the fastest time and fewest moves.\nUsing vanilla javascript content is dynamically served to the user by interacting with the DOM. The user is able to control several features of the game, such as pausing, restarting and enabling sound. Using ES6 standard javascript the user’s stats are recorded and displayed in the browser accordingly.",
        "id": 4,
        "img": "portfolio-pairs.png",
        "project_url": "https://leecharltonh.github.io/pairs-game/",
        "skills": [
            "HTML",
            "CSS",
            "Vanilla Javascript"
        ],
        "title": "Javascript Pairs Game"
    },
    "item5": {
        "description": "Bear Ambition is a Health & Fitness company offering personal training and online coaching. This client required a website to display their services and allow visitors to submit an enquiry.\nThis website was developed using React and utilises many features of this javascript framework. Form validation has been applied to the form to ensure data is captured accurately.",
        "id": 5,
        "img": "portfolio-bear-ambition.png",
        "project_url": "https://www.bearambition.com/",
        "skills": [
            "React",
            "Javascript",
            "HTML",
            "Scss"
        ],
        "title": "Bear Ambition Personal Training"
    },
    "item6": {
        "description": "A tracker which records, displays and filters expenses by year and month.\nThis application was built using React, which allows users to make new entries by submitting new expenses via a form. This state change then triggers several components to update such as the list of expenses and the filter components.",
        "id": 6,
        "img": "portfolio-expense-form.jpg",
        "project_url": "https://leecharltonh.github.io/expenses-form/",
        "skills": [
            "React",
            "Javascript",
            "HTML",
            "Scss"
        ],
        "title": "Expenses Form - React"
    },
    "item7": {
        "description": "This was the first project I developed whilst studying the Frontend Developer course with The Learning People. It was the first draft of my personal portfolio, which was developed using HTML5 and CSS3. ",
        "id": 7,
        "img": "portfolio-personal-portfolio.png",
        "project_url": "https://leecharltonh.github.io/personal-portfolio/",
        "skills": [
            "HTML",
            "CSS"
        ],
        "title": "Personal Portfolio V1"
    }
}